Revit 2026 API

# ParameterTypeIdInstanceFreeHostParam Property

---

"Host"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId InstanceFreeHostParam { get; }
```
```vb
Public Shared ReadOnly Property InstanceFreeHostParam As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ InstanceFreeHostParam {
	ForgeTypeId^ get ();
}
```
```fsharp
static member InstanceFreeHostParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace